package com.pathz.solid.s;

public class Employee {

    /**
     * реалізацію методу визначають адміністратори баз даних, що підпорядковуються тех. директору
     */
    public void save() {
        // зберігання працівника у базу даних
    }

    /**
     * реалізацію методу визначає і використовує відділ роботи з персоналом, що підпорядковується операційному директору
     */
    public void reportHours() {
        // друк звіту про користувача
        // regularHours
    }

    /**
     * реалізацію методу визначає бухгалтерія, що підпорядковується фінаносовому директлору
     */
    public void calculatePay() {
        // розрахунок заробітньої плати
        // regularHours
    }

    /**
     * цей метод використовується і в 'reportHours' і тут 'calculatePay'
     */
    public void regularHours() {
        // ----
        // розрахунок робочого часу
    }
}
